# Import Libraries

In [660]:
import warnings
warnings.filterwarnings('ignore')

In [661]:
import csv
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [662]:
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import accuracy_score, log_loss, confusion_matrix
from sklearn.preprocessing import MinMaxScaler
from sklearn.metrics import r2_score

# Training

In [679]:
x = allen1.drop(['S.No','salary package per month'],axis=1)
x.head()

,company,Age,Gender,Qualification,no of experience in years,Area of work
0,0,0.000000,1,0,0.000000,3
1,0,0.136364,0,1,0.047619,2
2,0,0.409091,1,1,0.238095,1
3,0,0.090909,1,0,0.095238,3
4,0,0.000000,0,0,0.000000,2

In [680]:
y = allen1['salary package per month']

In [681]:
xtrain, xtest, ytrain, ytest = train_test_split(x,y,test_size=0.48,random_state=1)

In [682]:
model = LinearRegression()
model.fit(xtrain,ytrain)
p = model.predict(xtest)
print(r2_score(ytest, p))

0.8081462969225229

# Test.csv - Creation

### Assignment Q1

In [683]:
companies = list(l1.inverse_transform([0,1,2,3,4,5,6,7]))

In [684]:
allen2 = 0
allen2 = pd.DataFrame(columns=['company','Age ','Gender','Qualification','no of experience in years','Area of work'])

In [685]:
for i in range(0,len(companies)):
    init = {"company": companies[i], 
            "Age ": 35,
            "Gender": "F",
            "Qualification": "B.E",
            "no of experience in years": 12,
            "Area of work": "cloud server management"
    }
    allen2 = allen2.append(init, ignore_index=True)

In [686]:
print(allen2.to_string())

        company Age  Gender Qualification no of experience in years             Area of work
0          ABBB   35      F           B.E                        12  cloud server management
1         Bashh   35      F           B.E                        12  cloud server management
2          Link   35      F           B.E                        12  cloud server management
3          Oxon   35      F           B.E                        12  cloud server management
4           TSC   35      F           B.E                        12  cloud server management
5  neuromorphic   35      F           B.E                        12  cloud server management
6          palm   35      F           B.E                        12  cloud server management
7      penguin    35      F           B.E                        12  cloud server management

# Test.csv - Label Encoding

### Company

In [687]:
l5 = preprocessing.LabelEncoder()
f5 = l5.fit_transform(allen2['company']) 
f5 = pd.DataFrame(data=f5, columns=['company'])

### Area

In [688]:
l6 = preprocessing.LabelEncoder()
f6 = l6.fit_transform(allen2['Area of work']) 
f6 = pd.DataFrame(data=f6, columns=['Area of work'])

### Gender

In [689]:
l7 = preprocessing.LabelEncoder()
f7 = l7.fit_transform(allen2['Gender']) 
f7 = pd.DataFrame(data=f7, columns=['Gender'])

### Qualification

In [690]:
l8 = preprocessing.LabelEncoder()
f8 = l8.fit_transform(allen2['Qualification']) 
f8 = pd.DataFrame(data=f8, columns=['Qualification'])

### Updation

In [691]:
allen2['company'] = f5['company']
allen2['Area of work'] = f6['Area of work']
allen2['Gender'] = f7['Gender']
allen2['Qualification'] = f8['Qualification']

# Test.csv - MinMaxScaler

In [692]:
ms = MinMaxScaler()
columns = ['Age ','no of experience in years']
allen2[columns] = ms.fit_transform(allen2[columns])

# Test.csv - Prediction

In [693]:
allen2.head(8)

,company,Age,Gender,Qualification,no of experience in years,Area of work
0,0,0.0,0,0,0.0,0
1,1,0.0,0,0,0.0,0
2,2,0.0,0,0,0.0,0
3,3,0.0,0,0,0.0,0
4,4,0.0,0,0,0.0,0
5,5,0.0,0,0,0.0,0
6,6,0.0,0,0,0.0,0
7,7,0.0,0,0,0.0,0

In [694]:
p2 = model.predict(allen2)

In [695]:
allen2['salary'] = p2
allen2.head(8)

,company,Age,Gender,Qualification,no of experience in years,Area of work,salary
0,0,0.0,0,0,0.0,0,69879.291815
1,1,0.0,0,0,0.0,0,63828.111187
2,2,0.0,0,0,0.0,0,57776.930560
3,3,0.0,0,0,0.0,0,51725.749932
4,4,0.0,0,0,0.0,0,45674.569305
5,5,0.0,0,0,0.0,0,39623.388678
6,6,0.0,0,0,0.0,0,33572.208050
7,7,0.0,0,0,0.0,0,27521.027423

# Test.csv - Index

In [696]:
print(l5.inverse_transform(f5['company']))
allen2['company'] = l5.inverse_transform(f5['company'])

['ABBB' 'Bashh' 'Link' 'Oxon' 'TSC' 'neuromorphic' 'palm' 'penguin ']

In [697]:
print(l6.inverse_transform(f6['Area of work']))
allen2['Area of work'] = l6.inverse_transform(f6['Area of work'])

['cloud server management' 'cloud server management'
 'cloud server management' 'cloud server management'
 'cloud server management' 'cloud server management'
 'cloud server management' 'cloud server management']

In [698]:
print(l7.inverse_transform(f7['Gender']))
allen2['Gender'] = l7.inverse_transform(f7['Gender'])

['F' 'F' 'F' 'F' 'F' 'F' 'F' 'F']

In [699]:
print(l8.inverse_transform(f8['Qualification']))
allen2['Qualification'] = l8.inverse_transform(f8['Qualification'])

['B.E' 'B.E' 'B.E' 'B.E' 'B.E' 'B.E' 'B.E' 'B.E']

In [700]:
print(ms.inverse_transform(allen2[columns]))
allen2[columns] = ms.inverse_transform(allen2[columns])

[[35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]
 [35. 12.]]